In [1]:
#

In [2]:
import numpy as np
import pandas as pd

In [3]:
sozlukVerisi = {"Istanbul":[30,29,np.nan], "Ankara":[20,np.nan,25],"Izmir":[40,39,20]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [4]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     20

In [5]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [6]:
havaDurumuDataFrame.dropna(axis = 1)

   Izmir
0     40
1     39
2     20

In [7]:
yeniVeri = {"Istanbul":[30,29,np.nan], "Ankara":[20,np.nan,25],"Izmir":[40,39,20],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [8]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     20      NaN

In [9]:
yeniDataFrame.dropna(axis = 1, thresh = 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     20

In [10]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     20     20.0

In [11]:
# groupby

In [12]:
    maasSozlugu = {"Departman": ["Yazilim","Yazilim","Pazarlama","Pazarlama","Finans","Finans"],
               "Çalışan İsmi":["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
               "Maas":[100,150,200,300,400,500]}

In [13]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [14]:
maasDataFrame

   Departman Çalışan İsmi  Maas
0    Yazilim        Ahmet   100
1    Yazilim       Mehmet   150
2  Pazarlama         Atil   200
3  Pazarlama        Burak   300
4     Finans       Zeynep   400
5     Finans        Fatma   500

In [15]:
grupObjesi = maasDataFrame.groupby("Departman")

In [16]:
grupObjesi.count()

           Çalışan İsmi  Maas
Departman
Finans                2     2
Pazarlama             2     2
Yazilim               2     2

In [17]:
grupObjesi.min()

          Çalışan İsmi  Maas
Departman
Finans           Fatma   400
Pazarlama         Atil   200
Yazilim          Ahmet   100

In [18]:
grupObjesi.max()

          Çalışan İsmi  Maas
Departman
Finans          Zeynep   500
Pazarlama        Burak   300
Yazilim         Mehmet   150

In [19]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Finans      2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazilim     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

In [20]:
sozluk_1 = {"Ahmet":[12,"Futbol","Mersin"], 
            "Ayse":[13,"Basketbol","Elazığ"], 
            "Faruk":[14,"Tenis","Hatay"]
           }

In [21]:
sozluk_2 = {"Emir":[15,"a","as"], 
            "Kemal":[16,"b","bs"], 
            "Deniz":[17,"c","cs"]
           }

In [22]:
sozluk_1

{'Ahmet': [12, 'Futbol', 'Mersin'],
 'Ayse': [13, 'Basketbol', 'Elazığ'],
 'Faruk': [14, 'Tenis', 'Hatay']}

In [23]:
dataFrame1 = pd.DataFrame(sozluk_1)

In [24]:
dataFrame1

    Ahmet       Ayse  Faruk
0      12         13     14
1  Futbol  Basketbol  Tenis
2  Mersin     Elazığ  Hatay

In [25]:
dataFrame2 = pd.DataFrame(sozluk_2)

In [26]:
dataFrame2

  Emir Kemal Deniz
0   15    16    17
1    a     b     c
2   as    bs    cs

In [27]:
pd.concat([dataFrame1,dataFrame2],axis=1)

    Ahmet       Ayse  Faruk Emir Kemal Deniz
0      12         13     14   15    16    17
1  Futbol  Basketbol  Tenis    a     b     c
2  Mersin     Elazığ  Hatay   as    bs    cs

In [28]:
pd.concat([dataFrame1,dataFrame2])

    Ahmet       Ayse  Faruk Emir Kemal Deniz
0      12         13     14  NaN   NaN   NaN
1  Futbol  Basketbol  Tenis  NaN   NaN   NaN
2  Mersin     Elazığ  Hatay  NaN   NaN   NaN
0     NaN        NaN    NaN   15    16    17
1     NaN        NaN    NaN    a     b     c
2     NaN        NaN    NaN   as    bs    cs

In [29]:
## merge

In [30]:
mergeSozluk1 = {"Isim": ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Spor": ["Koşu","Yüzme","Koşu","Basketbol"]
               }

In [31]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [32]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [33]:
mergeSozluk2 = {"Isim": ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Kalori": [100,200,150,250]
               }

In [34]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [35]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [36]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on="Isim") # merge yanyana ekler

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

In [37]:
pd.concat([mergeDataFrame1,mergeDataFrame2]) ## concat alt alta

     Isim       Spor  Kalori
0   Ahmet       Koşu     NaN
1  Mehmet      Yüzme     NaN
2  Zeynep       Koşu     NaN
3    Atıl  Basketbol     NaN
0   Ahmet        NaN   100.0
1  Mehmet        NaN   200.0
2  Zeynep        NaN   150.0
3    Atıl        NaN   250.0

In [38]:
pd.concat([mergeDataFrame1,mergeDataFrame2] , axis= 1) ## merge ortak kümeye alıyor, concat yalnızca yan yana ekliyor.

     Isim       Spor    Isim  Kalori
0   Ahmet       Koşu   Ahmet     100
1  Mehmet      Yüzme  Mehmet     200
2  Zeynep       Koşu  Zeynep     150
3    Atıl  Basketbol    Atıl     250

In [39]:
maasSozluk = {"Isim" : ["Atıl","Zeynep","Mehmet","Ahmet"],
             "Departman" : ["Yazılım","Satış","Pazarlama","Yazılım"],
             "Maas" : [200,300,400,500]}

In [40]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [41]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [42]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [43]:
maasDataFrame["Departman"].nunique()

3

In [44]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [45]:
def bruttenNete(maas):
    return maas * 0.66

In [46]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [47]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [48]:
yeniBirVeri = {"Karakter Sınıfı" : ["South Park","South Park","Simpson","Simpson","Simpson"],
              "Karakter Ismi" : [ "Cartman","Kenny","Homer","Bart","Bart"],
              "Karakter Yas" : [9,10,50,20,10]}

In [49]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [50]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [51]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                   15.0
                Homer                  50.0
South Park      Cartman                 9.0
                Kenny                  10.0

In [52]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"], aggfunc= np.sum)

/var/folders/j0/bf4kc2qs1nq03wpsvxy916fm0000gn/T/ipykernel_21642/2810994076.py:1: FutureWarning: The provided callable <function sum at 0x112926520> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"], aggfunc= np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

In [53]:
import pandas as pd

In [54]:
my_df = pd.read_excel("maas.xlsx")

In [59]:
my_df

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   100  40.0    Yazılım
1     Zeynep   150  50.0      Satış
2     Mehmet   200  30.0        NaN
3      Ahmet    50  10.0  Pazarlama
4      Atlas   150   NaN     Finans
5      Fatma   200  25.0      Hukuk

In [63]:
doludegerler = my_df.dropna()

In [65]:
doludegerler

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   100  40.0    Yazılım
1     Zeynep   150  50.0      Satış
3      Ahmet    50  10.0  Pazarlama
5      Fatma   200  25.0      Hukuk

In [67]:
doludegerler.to_excel("yenimaas.xlsx")